Repository: jorviizheng/MongoDoc-zh
Catalog: locale/*/LC_MESSAGES/core/document.po
Languages: es

source: Documents
es: Documentos

source: MongoDB stores all data in documents, which are JSON-style data structures composed of field-and-value pairs:
es: MongoDB almacena todos los datos en documentos, que son estructuras de datos parecidas a JSON compuestas de pares de campo y valor.

source: Most user-accessible data structures in MongoDB are documents, including:
es: Muchas de las estructuras de datos accesibles para el usuario son documentos, incluyendo:

source: All database records.
es: Todos los registros de base de datos.

source: :doc:`Query selectors </core/read-operations>`, which define what records to select for read, update, and delete operations.
es: :doc:`Selectores de consulta </core/read-operations>`, que definen qué registros seleccionar para operaciones de consulta, actualización y eliminación.

source: :doc:`Update definitions </core/write-operations>`, which define what fields to modify during an update.
es: :doc:`Definiciones de actualización </core/write-operations>`, que definen qué campos modificar en una actualización.

source: :doc:`Index specifications </core/indexes>`, which define what fields to index.
es: :doc:`Especificaciones de índices </core/indexes>`, que define qué campos indexar.

source: Data output by MongoDB for reporting and configuration, such as the output of the :dbcommand:`serverStatus` and the :ref:`replica set configuration document <replica-set-configuration-document>`.
es: Datos salientes de MongoDB para reportes y configuración, tales como la salida de :dbcommand:`serverStatus` y el :ref:`documento de configuración de conjuntos de réplicas <replica-set-configuration-document>`.

source: Document Format
es: Formato de documentos

source: The :program:`mongo` JavaScript shell and the :doc:`MongoDB language drivers </applications/drivers>` translate between BSON and the language-specific document representation.
es: El shell JavaScript :program:`mongo` y los :doc:`drivers de MongoDB </applications/drivers>` traducen entre BSON y la representación de documentos en los lenguajes específicos.

source: Document Structure
es: Estructura de documentos

source: MongoDB documents are composed of field-and-value pairs and have the following structure:
es: Los documentos de MongoDB son compuestos por pares de campo y valor y tienen la siguiente estructura:

source: The value of a field can be any of the BSON :doc:`data types </reference/bson-types>`, including other documents, arrays, and arrays of documents. The following document contains values of varying types:
es: El valor de un campo puede ser cualquier :doc:`tipo de datos </reference/bson-types>` de BSON, incluyendo otros documentos, arrays y arrays de documentos. Los siguientes documentos contienen valores de los diversos tipos:

source: The above fields have the following data types:
es: Los campos anteriores tienen los siguientes tipos de datos:

source: ``_id`` holds an *ObjectId*.
es: ``_id`` tiene un *ObjectId*.

source: ``name`` holds a *subdocument* that contains the fields ``first`` and ``last``.
es: ``name`` tiene un *subdocumento* que contiene los campos ``first`` y ``last``.

source: ``birth`` and ``death`` hold values of the *Date* type.
es: ``birth`` y ``death`` tienen valores de tipo *Date*.

source: ``contribs`` holds an *array of strings*.
es: ``contribs`` tiene un *array de cadenas*.

source: ``views`` holds a value of the *NumberLong* type.
es: ``views`` tiene un valor de tipo *NumberLong*.

source: Field Names
es: Nombres de campos

source: Field names are strings.
es: Nombres de campos son cadenas.

source: :doc:`Documents </core/document>` have the following restrictions on field names:
es: :doc:`Los documentos </core/document>` tienen las siguientes restricciones en los nombres de campos:

source: The field name ``_id`` is reserved for use as a primary key; its value must be unique in the collection, is immutable, and may be of any type other than an array.
es: El nombre de campo ``_id`` está reservado para su uso como clave primaria; su valor debe ser único en la colección, es inmutable y puede ser de cualquier tipo excepto un array.

source: The field names **cannot** start with the dollar sign (``$``) character.
es: Los nombres de campos **no pueden** empezar con el caracter de signo dolar (``$``).

source: The field names **cannot** contain the dot (``.``) character.
es: Los nombres de campos **no pueden** contener el caracter punto (``.``).

source: The field names **cannot** contain the ``null`` character.
es: Los nombres de campos **no pueden** contener el caracter ``null``.

source: BSON documents may have more than one field with the same name. Most :doc:`MongoDB interfaces </applications/drivers>`, however, represent MongoDB with a structure (e.g. a hash table) that does not support duplicate field names. If you need to manipulate documents that have more than one field with the same name, see the :doc:`driver documentation </applications/drivers>` for your driver.
es: Los documentos BSON pueden tener más de un campo con el mismo nombre. Muchas de las :doc:`interfaces de MongoDB </applications/drivers>`, por el contrario, representan a MongoDB con una estructura (por ejemplo un hash table) que no soportan nombres de campos duplicados. Si necesitas manipular documentos que tengan más de un campo con el mismo nombre, consulta la :doc:`documentación para tu driver </applications/drivers>`.

source: Some documents created by internal MongoDB processes may have duplicate fields, but *no* MongoDB process will *ever* add duplicate fields to an existing user document.
es: Algunos documentos creados por procesos internos de MongoDB podrían tener campos duplicados, pero MongoDB *jamás* añade campos duplicados a un documento de usuario existente.

source: Document Limitations
es: Limitaciones de documentos

source: Documents have the following attributes:
es: Los documentos tienen los siguientes atributos:

source: Document Size Limit
es: Límite de tamaño de documento

source: The maximum BSON document size is 16 megabytes.
es: El tamaño máximo de un documento BSON es de 16 megabytes.

source: The maximum document size helps ensure that a single document cannot use excessive amount of RAM or, during transmission, excessive amount of bandwidth. To store documents larger than the maximum size, MongoDB provides the GridFS API. See :program:`mongofiles` and the documentation for your :doc:`driver </applications/drivers>` for more information about GridFS.
es: El tamaño máximo de los documento ayuda a asegurar que un solo documento no pueda exceder la cantidad de RAM, o que durante una transmisión de datos, supere el ancho de banda. Para almacenar documentos más grandes que el tamaño máximo, MongoDB proporciona GridFS. Consulta :program:`mongofiles` y la documentación para tu :doc:`driver </applications/drivers>` para mayor información acerca de GridFS.

source: Document Field Order
es: Orden de campos en documentos

source: MongoDB preserves the order of the document fields following write operations *except* for the following cases:
es: MongoDB conserva el orden de los campos de los documentos para las operaciones de escritura *excepto* para los siguientes casos:

source: The ``_id`` field is always the first field in the document.
es: El campo ``_id`` siempre es el primer campo en el documento.

source: Updates that include :update:`renaming <$rename>` of field names may result in the reordering of fields in the document.
es: Actualizaciones que incluyen :update:`renombrar <$rename>` nombres de campos pueden resultar reordenando los campos en el documento.

source: Starting in version 2.6, MongoDB actively attempts to preserve the field order in a document. Before version 2.6, MongoDB did not actively preserve the order of the fields in a document.
es: A partir de la versión 2.6, MongoDB intenta activamente conservar el orden de los campos en un documento. Antes de la versión 2.6, MongoDB no conserva activamente el orden de los campos en un documento.

source: The ``_id`` Field
es: El campo ``_id``

source: The ``_id`` field has the following behavior and constraints:
es: El campo ``_id`` tiene el siguiente comportamiento y restricciones:

source: By default, MongoDB creates a unique index on the ``_id`` field during the creation of a collection.
es: Por defecto, MongoDB crea un índice único en el campo ``_id`` en la creación de una colección.

source: The ``_id`` field is always the first field in the documents. If the server receives a document that does not have the ``_id`` field first, then the server will move the field to the beginning.
es: El campo ``_id`` siempre es el primer campo en los documentos. Si es servidor recibe un documento que no tiene el campo ``_id`` primero, entonces el servidor lo moverá hacia el inicio.

source: The ``_id`` field may contain values of any :doc:`BSON data type </reference/bson-types>`, other than an array.
es: El campo ``_id`` podría contener valores de cualquier :doc:`tipo de dato BSON </reference/bson-types>` distinto que un array.

source: To ensure functioning replication, do not store values that are of the BSON regular expression type in the ``_id`` field.
es: Para asegurar el funcionamiento de replicación, no almacenes valores que son de tipo de expresiones regulares de BSON en el campo ``_id``.

source: The following are common options for storing values for ``_id``:
es: Los siguientes son opciones comunes para almacenar valores para ``_id``:

source: Use an :doc:`ObjectId </reference/object-id>`.
es: Utilizar un :doc:`ObjectId </reference/object-id>`.

source: Use a natural unique identifier, if available. This saves space and avoids an additional index.
es: Utilizar un identificador único natural, si está disponible. Esto ahorra espacio y evita un índice adicional.

source: Generate an auto-incrementing number. See :doc:`/tutorial/create-an-auto-incrementing-field`.
es: Generar un número autoincremental. Consulta :doc:`/tutorial/create-an-auto-incrementing-field`.

source: Generate a UUID in your application code. For a more efficient storage of the UUID values in the collection and in the ``_id`` index, store the UUID as a value of the BSON ``BinData`` type.
es: Generar un UUID en el código de tu aplicación. Para un almacenamiento más eficiente de los valores UUID en la colección y en el índice ``_id``, almacena los UUID como un valor del tipo BSON ``BinData``.

source: Index keys that are of the ``BinData`` type are more efficiently stored in the index if:
es: Las claves de los índices que son del tipo ``BinData`` son almacenados más eficientemente en el índice si:

source: the binary subtype value is in the range of 0-7 or 128-135, and
es: el valor del subtipo del binario está en el rango de 0-7 o 128-135, y

source: the length of the byte array is: 0, 1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 14, 16, 20, 24, or 32.
es: la longitud del array de bytes es: 0, 1, 2, 3, 4, 5, 6, 7, 8, 10, 12, 14, 16, 20, 24 o 32.

source: Use your driver's BSON UUID facility to generate UUIDs. Be aware that driver implementations may implement UUID serialization and deserialization logic differently, which may not be fully compatible with other drivers. See your :api:`driver documentation <>` for information concerning UUID interoperability.
es: Utiliza la habilidad de BSON UUID de tu driver para generar UUIDs. Ten presente que las implementaciones de los drivers podrían implementar una lógica distinta para la serialización y deserialización de UUID, que no podrían ser completamente compatibles con otros drivers. Consulta la :api:`documentación de tu driver <>` para más información concerniente a la interoperatibilidad de UUID.

source: Most MongoDB driver clients will include the ``_id`` field and generate an ``ObjectId`` before sending the insert operation to MongoDB; however, if the client sends a document without an ``_id`` field, the :program:`mongod` will add the ``_id`` field and generate the ``ObjectId``.
es: Muchos drivers clientes de MongoDB incluirán el campo ``_id`` y generarán un ``ObjectId`` antes de enviar la operación de inserción a MongoDB; sin embargo, si el cliente envía un documento sin un campo ``_id``, :program:`mongod` añadirá el campo ``_id`` y generará el ``ObjectId``.

source: MongoDB uses the *dot notation* to access the elements of an array and to access the fields of a subdocument.
es: MongoDB utiliza *dot notation* para acceder a los elementos de un array y para acceder a los campos de un subdocumento.

source: To access an element of an array by the zero-based index position, concatenate the array name with the dot (``.``) and zero-based index position, and enclose in quotes:
es: Para acceder a un elemento de un array por el índice de posición basado en cero, concatena el nombre del array con el punto (``.``) y el índice de posición basado en cero, y encierra entre comillas:

source: To access a field of a subdocument with *dot-notation*, concatenate the subdocument name with the dot (``.``) and the field name, and enclose in quotes:
es: Para acceder a un campo de un subdocumento con *dot-notation*, concatena el nombre del subdocumento con el punto (``.``) y el nombre del campo, y encierra entre comillas:

source: :ref:`read-operations-subdocuments` for dot notation examples with subdocuments.
es: :ref:`read-operations-subdocuments` para ver ejemplos de dot notation con subdocumentos.

source: :ref:`read-operations-arrays` for dot notation examples with arrays.
es: :ref:`read-operations-arrays` para ver ejemplos de dot notation con arrays.
